use Gameshop;
INSERT INTO 用户
(用户名, 姓名, 密码)
VALUES
("刘希","刘希",123456),
("孙立飞","孙立飞",123456),
("王新宇","王新宇",123456);


INSERT INTO 游戏
(名称, 类型, 生产商, 价格)
VALUES
("a","动作", "lx", 0),
("b","悬疑", "lx", 1),
("c","冒险", "slf", 2),
("d","运动", "slf", 3),
("e","动作", "wxy", 4),
("lol","moba", "wxy", 5);

INSERT INTO 管理员
(用户名, 密码)
VALUES
("admin",123456);

INSERT INTO 生产商
(用户名, 密码)
VALUES
("lx",123456),
("slf",123456),
("wxy",123456);

INSERT INTO 订单
(用户, 游戏编号, 时间)
VALUES
("刘希",1,"2020-12-23"),
("孙立飞",2,"2020-12-23"),
("孙立飞",3,"2020-12-23"),
("王新宇",3,"2020-12-23");

INSERT INTO 购物车
(用户)
VALUES
("刘希"),
("孙立飞"),
("孙立飞"),
("王新宇");

INSERT INTO 评论
(游戏名称, 用户名, 内容)
VALUES
("lol","刘希","有丶东西"),
("b","刘希","有丶东西"),
("c","孙立飞","有丶东西"),
("a","王新宇","有丶东西");

INSERT INTO 公告
(标题, 内容)
VALUES
("","lxnb"),
("","slfnb"),
("","wxycb");

--INSERT INTO 购物车游戏
--(购物车编号, 游戏编号)
--VALUES
--();